; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v5 - type_1 ?v1 - type_2)
 	      (pred_2 ?v3 - object ?v1 - type_2)
	      (pred_4 ?v5 - type_1 ?v4 - type_3)
	      (pred_1 ?v5 - type_1 ?v3 - object ?v4 - type_3))

   (:action op_3
       :parameters  (?v5 - type_1 ?v2 ?v8 - type_2)
       :precondition (and  (pred_3 ?v5 ?v2))
       :effect (and  (pred_3 ?v5 ?v8)
		     (not (pred_3 ?v5 ?v2))))

   (:action op_2
       :parameters (?v5 - type_1 ?v7 - object ?v6 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_2 ?v7 ?v6) (pred_3 ?v5 ?v6) (pred_4 ?v5 ?v4))
       :effect (and (pred_1 ?v5 ?v7 ?v4)
		    (not (pred_2 ?v7 ?v6)) 
		    (not (pred_4 ?v5 ?v4))))

   (:action op_1
       :parameters (?v5 - type_1 ?v7 - object ?v6 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_1 ?v5 ?v7 ?v4) (pred_3 ?v5 ?v6))
       :effect (and (pred_2 ?v7 ?v6)
		    (pred_4 ?v5 ?v4)
		    (not (pred_1 ?v5 ?v7 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_05 obj_11 - type_1
obj_06 obj_10 obj_01 obj_08 - type_3
obj_07 obj_13 obj_09 obj_02 - type_2
obj_03 obj_12 obj_04 obj_14 - object)
(:init
(pred_3 obj_05 obj_02)
(pred_4 obj_05 obj_06)
(pred_4 obj_05 obj_10)
(pred_3 obj_11 obj_09)
(pred_4 obj_11 obj_01)
(pred_4 obj_11 obj_08)
(pred_2 obj_03 obj_13)
(pred_2 obj_12 obj_07)
(pred_2 obj_04 obj_02)
(pred_2 obj_14 obj_13)
)
(:goal
(and
(pred_2 obj_03 obj_09)
(pred_2 obj_12 obj_09)
(pred_2 obj_04 obj_07)
(pred_2 obj_14 obj_07)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_05 obj_07) (pred_3 obj_11 obj_07))))
    (always (not (and (pred_3 obj_05 obj_13) (pred_3 obj_11 obj_13))))
  )
)
)

; plan
1. (op_2 obj_05 obj_04 obj_02 obj_10)
   deleted: (pred_2 obj_04 obj_02) (pred_4 obj_05 obj_10)
   added: (pred_1 obj_05 obj_04 obj_10)
   goals met: 0 of 4
2. (op_3 obj_11 obj_09 obj_13)
   deleted: (pred_3 obj_11 obj_09)
   added: (pred_3 obj_11 obj_13)
   goals met: 0 of 4
3. (op_3 obj_05 obj_02 obj_07)
   deleted: (pred_3 obj_05 obj_02)
   added: (pred_3 obj_05 obj_07)
   goals met: 0 of 4
4. (op_2 obj_11 obj_14 obj_13 obj_08)
   deleted: (pred_2 obj_14 obj_13) (pred_4 obj_11 obj_08)
   added: (pred_1 obj_11 obj_14 obj_08)
   goals met: 0 of 4
5. (op_2 obj_11 obj_03 obj_13 obj_01)
   deleted: (pred_2 obj_03 obj_13) (pred_4 obj_11 obj_01)
   added: (pred_1 obj_11 obj_03 obj_01)
   goals met: 0 of 4
6. (op_1 obj_05 obj_04 obj_07 obj_10)
   deleted: (pred_1 obj_05 obj_04 obj_10)
   added: (pred_2 obj_04 obj_07) (pred_4 obj_05 obj_10)
   goals met: 1 of 4
7. (op_3 obj_11 obj_13 obj_09)
   deleted: (pred_3 obj_11 obj_13)
   added: (pred_3 obj_11 obj_09)
   goals met: 1 of 4
8. (op_2 obj_05 obj_12 obj_07 obj_06)
   deleted: (pred_2 obj_12 obj_07) (pred_4 obj_05 obj_06)
   added: (pred_1 obj_05 obj_12 obj_06)
   goals met: 1 of 4
9. (op_3 obj_05 obj_07 obj_09)
   deleted: (pred_3 obj_05 obj_07)
   added: (pred_3 obj_05 obj_09)
   goals met: 1 of 4
10. (op_1 obj_11 obj_03 obj_09 obj_01)
   deleted: (pred_1 obj_11 obj_03 obj_01)
   added: (pred_2 obj_03 obj_09) (pred_4 obj_11 obj_01)
   goals met: 2 of 4
11. (op_3 obj_11 obj_09 obj_07)
   deleted: (pred_3 obj_11 obj_09)
   added: (pred_3 obj_11 obj_07)
   goals met: 2 of 4
12. (op_1 obj_05 obj_12 obj_09 obj_06)
   deleted: (pred_1 obj_05 obj_12 obj_06)
   added: (pred_2 obj_12 obj_09) (pred_4 obj_05 obj_06)
   goals met: 3 of 4
13. (op_1 obj_11 obj_14 obj_07 obj_08)
   deleted: (pred_1 obj_11 obj_14 obj_08)
   added: (pred_2 obj_14 obj_07) (pred_4 obj_11 obj_08)
   goals met: 4 of 4
